# R?
#   => R은 통계를 위한 프로그래밍 언어
#   => 또한, 수치를 계산하고,
#      그래프 등의 시각화 기능을 가진 언어

# R을쓰는 이유?
#   => 기본적인 통계와 시각화 기능 - R에 통계용어가 꽤 많음
#   => 다양한 통계, 시각화 패키지들이 존재
#   => 무료, 오픈소스임
#   => Data Frame이라는 매력적인 자료형이 존재

# Data Frame?
#   => Table형식의 데이터를 표현하고, 다루는 방식
#   => 여러개의 행, 열로 구성된 2차원 형식의 데이터구조
#   => RDBMS(ex : Oracle)의 테이블같은 느낌
#   => 정수, 실수, 문자열, ... 의 여러 데이터를 처리가능

# 단축키
#   한줄 실행   : (커서를 갖다대고)ctrl enter
#   전체 실행   : ctrl shift enter
#   한줄 지우기 : ctrl D
#   콘솔 초기화 : ctrl L
#   주석처리    : ctrl shift C
#   자동완성    : Tab
